# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# Liu Zhongtian AGPL-3.0 License - midsky@zju.edu.cn

# YOLOv10n object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov10
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, UFSCLayer, [3, 64, True]] # 0-P1/4
  - [-1, 1, UFSCLayer, [64, 128, False]] # 1-P2/8  
  - [-1, 1, UFSCLayer, [128, 256, False]] # 2-P3/16
  - [-1, 1, UFSCLayer, [256, 512, False]] # 3-P4/32
  - [-1, 3, C2f, [512, True]] # 4
  - [-1, 1, SPPF, [512, 5]]  # 5

# YOLOv10.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 6
  - [[-1, 2], 1, Concat, [1]] # 7 cat backbone P3
  - [-1, 3, C2f, [256]] # 8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 1], 1, Concat, [1]] # 10 cat backbone P2
  - [-1, 3, C2f, [128]] # 11 (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]] # 12
  - [[-1, 8], 1, Concat, [1]] # 13 cat head P3
  - [-1, 3, C2f, [256]] # 14 (P3/16-medium)

  - [-1, 1, SCDown, [256, 3, 2]] # 15
  - [[-1, 5], 1, Concat, [1]] # 16 cat head P4
  - [-1, 3, C2fCIB, [512, True, True]] # 17 (P4/32-large)

  - [[11, 14, 17], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
